### 14. Intro to Foreign Keys

* A foreign key is a link between tables. The foreign key in a first table "points" to, or is linked to, the primary key in a second table.

* A foreign key also prevents invalid data from being entered into a column. The data being entered **has** to be a value from the referenced column.

In [1]:
from sqlalchemy import create_engine
import pandas as pd
from warnings import filterwarnings
import pymysql
filterwarnings('ignore', category=pymysql.Warning)
import os
engine = create_engine('mysql+pymysql://root:kcmo1728@localhost')  # connect to server
engine.execute("create database if not exists foreign_keys") #create db

In [2]:
engine = create_engine('mysql+pymysql://root:kcmo1728@localhost/foreign_keys')

In [3]:
def RunSQL(sql_command):
    connection = pymysql.connect(host='localhost',
                             user='root',
                             password='kcmo1728',
                             db='foreign_keys',
                             charset='utf8mb4',
                             cursorclass=pymysql.cursors.DictCursor)
    try:
        with connection.cursor() as cursor:
            commands = sql_command.split(';')
            for command in commands:
                if command == '\n': continue
                cursor.execute(command + ';')
                connection.commit()
    except Exception as e: 
        print(e)
    finally:
        connection.close()

In [4]:
sql_query = """
drop table if exists animals_location;
drop table if exists animals_all;

create table animals_all (
 id integer(11) auto_increment not null,
 animal_species varchar(30) not null,
 owner_name varchar(30) not null,
 primary key (id)
);

insert into animals_all (animal_species, owner_name) values 
("Dog", "Bob"),
("Fish", "Bob"),
("Cat", "Kelly"),
("Dolphin", "Aquaman");
"""

In [5]:
RunSQL(sql_query)

In [6]:
animals = pd.read_sql_query('select * from animals_all', engine)
animals

   id animal_species owner_name
0   1            Dog        Bob
1   2           Fish        Bob
2   3            Cat      Kelly
3   4        Dolphin    Aquaman

## Foreign Keys

* Each of these animals has a location. This data is stored in another table.
* Foreign keys allow us to connect the animal its location.

In [7]:
sql_query = """
   CREATE TABLE animals_location (
   id INTEGER(11) AUTO_INCREMENT NOT NULL,
   location VARCHAR(30) NOT NULL,
   animal_id INTEGER(10) NOT NULL,
   PRIMARY KEY (id),
   FOREIGN KEY (animal_id) REFERENCES animals_all(id) 
   );
   
   
   INSERT INTO animals_location (location, animal_id)
   VALUES ("Doghouse", 1);
 
   INSERT INTO animals_location (location, animal_id)
   VALUES ("Fish tank", 2);
 
   INSERT INTO animals_location (location, animal_id)
   VALUES ("Bed", 3);
 
   INSERT INTO animals_location (location, animal_id)
   VALUES ("Ocean", 4);
"""
RunSQL(sql_query)

* The **primary key** is the `id` column.
* `FOREIGN KEY (animal_id)` identifies the `animal_id` column as a **foreign key**. 
* Next, `REFERENCES animals_all(id)` tells us that `animal_id` references, or is linked to, the `id` column in the `animals_all` table. 

* The `id` column is the primary key of the `animals_all` table, while `animal_id` is a foreign key in the `animals_location` table. 

* Both columns, even though they have different names, are designed to contain the same data. In fact, MySQL will complain if we try to change the data in only one of these columns. It is generally a good idea to name foreign key columns to make clear what data they refer to.

In [8]:
animals = pd.read_sql_query('select * from animals_location', engine)
animals

   id   location  animal_id
0   1   Doghouse          1
1   2  Fish tank          2
2   3        Bed          3
3   4      Ocean          4

* Now let's create a new location in the animals_location table:

In [9]:
sql_query = """
   INSERT INTO animals_location (location, animal_id) 
   VALUES ("River", 5);
"""
RunSQL(sql_query)

(1452, 'Cannot add or update a child row: a foreign key constraint fails (`foreign_keys`.`animals_location`, CONSTRAINT `animals_location_ibfk_1` FOREIGN KEY (`animal_id`) REFERENCES `animals_all` (`id`))')

** it breaks! Why? **

* It is because the `animal_id` column is a foreign key that is pegged to the `id` column in the `animals_all` table. So why, exactly, can't we insert the row above? It's because `id` 5 doesn't exist in the `animals_all` table!

In [10]:
sql_query = """
   INSERT INTO animals_location (location, animal_id) 
   VALUES ("River", 4);
"""
RunSQL(sql_query)

This runs! Of course, now our dolphin can be in both Rivers and the Ocean.

In [11]:
animals = pd.read_sql_query('select * from animals_all', engine)
animals

   id animal_species owner_name
0   1            Dog        Bob
1   2           Fish        Bob
2   3            Cat      Kelly
3   4        Dolphin    Aquaman

In [12]:
sql_query = """
select * from animals_all
join animals_location
on animals_all.id = animals_location.animal_id
where animals_all.animal_species = 'Dolphin'
"""
animals = pd.read_sql_query(sql_query, engine)
animals

   id animal_species owner_name  id location  animal_id
0   4        Dolphin    Aquaman   4    Ocean          4
1   4        Dolphin    Aquaman   6    River          4

If you wanted Aquaman's dolphin to ONLY be in one location, you can make your Foreign Key **Unique**:

In [13]:
sql_query = """
   drop table if exists animals_location;
   create table animals_location (
   id integer(11) auto_increment not null,
   location varchar(30) not null,
   animal_id integer(10) not null,
   primary key (id),
   foreign key (animal_id) references animals_all(id),
   unique (animal_id)
   );
   
   
   insert into animals_location (location, animal_id)
   values ("Doghouse", 1);
 
   insert into animals_location (location, animal_id)
   values ("Fish tank", 2);
 
   insert into animals_location (location, animal_id)
   values ("Bed", 3);
 
   INSERT INTO animals_location (location, animal_id)
   VALUES ("Ocean", 4);
"""
RunSQL(sql_query)

* Now Aquaman's dolpin must be in one spot.

In [14]:
sql_query = """
   INSERT INTO animals_location (location, animal_id) 
   VALUES ("River", 4);
"""
RunSQL(sql_query)

(1062, "Duplicate entry '4' for key 'animal_id'")